Repository: NcPeter/NC_Tool
Catalog: Languages/*_Lang.resx
Languages: de

# String274
source: The diameter of the raw part is too small for finishing, it needs to be roughed first!
de: Der Durchmesser des Rohteil ist zu klein zum Schlichten, es wird vorher geschruppt!

# String275
source: A NOTICE
de: HINWEIS

# String276
source: ( roughing )
de: ( schruppen )

# String277
source: ( finish )
de: ( schlichten )

# String278
source: ( Program: Milling circular spigots )
de: ( Programm: Kreiszapfen fräsen )

# String279
source: ( Program: Milling circular pocket )
de: ( Programm: Kreistasche fräsen )

# String28
source: Drilling pattern hole circle
de: Bohrbild Lochkreis

# String280
source: G-code generation was aborted! The diameter of the raw part must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Der Durchmesser des Rohteil muss kleiner als der maximale Fahrweg der Maschine sein!

# String281
source: G-code generation was aborted! The diameter of the finished part must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Der Durchmesser des Fertigteil muss größer als 0 sein!

# String282
source: G-code generation was aborted! The diameter of the finished part must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Der Durchmesser des Fertiteil muss kleiner als der maximale Fahrweg der Maschine sein!

# String283
source: ( Program: milling ring groove )
de: ( Programm: Ringnut fräsen )

# String284
source: G-code generation was aborted! The inside diameter cannot be larger than the outside diameter!
de: Die G-Code Generierung wurde abgebrochen! Der Innendurchmesser kann nicht größer als der Außendurchmesser sein!

# String285
source: G-code generation was aborted! The selected tool does not fit into the desired ring groove (select a smaller tool)!
de: Die G-Code Generierung wurde abgebrochen! Das ausgewählte Werkzeug passt nicht in die gewünschte Ringnut (kleineres Werkzeug wählen)!

# String286
source: G-code generation was aborted! The dimensions for the outside diameter must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Maßangaben für den Außendurchmesser müssen kleiner als der maximale Fahrweg der Maschine sein!

# String287
source: ( Program: drilling table )
de: ( Programm: Bohrtabelle )

# String288
source: ( Drill diameter
de: ( Bohrerdurchmesser

# String289
source: G-code generation was aborted! The drill diameter must be greater than 0 and less than or equal to 8 mm!
de: Die G-Code Generierung wurde abgebrochen! Der Bohrerdurchmesser muss größer als 0 und kleiner oder gleich 8 mm sein!

# String29
source: Hole pattern on lines
de: Bohrbild Lochmuster auf Linien

# String290
source: G-code generation was aborted! The drilling depth must be less than 0! (enter negative values)
de: Die G-Code Generierung wurde abgebrochen! Die Bohrtiefe muss kleiner als 0 sein! (negative Werte eingeben)

# String291
source: G-code generation was aborted! The drilling depth must be within the working area of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Bohrtiefe muss sich im Arbeitsbereich der Maschine befinden!

# String292
source: G-code generation was aborted! The infeed in Z must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! ie Zustellung in Z muss größer als 0 sein!

# String293
source: G-code generation was aborted! The drilling depth of chip breakage must not be smaller than 0!
de: Die G-Code Generierung wurde abgebrochen! Die Bohrtiefe Spanbruch darf nicht kleiner als 0 sein!

# String294
source: G-code generation was aborted! The retraction until the chip breaks must not be less than 0!
de: Die G-Code Generierung wurde abgebrochen! Der Rückzug bis Spanbruch darf nicht kleiner als 0 sein!

# String295
source: G-code generation was aborted! The chipping depth must be less than 0! (enter negative values)
de: Die G-Code Generierung wurde abgebrochen! Die Ausspantiefe muss kleiner als 0 sein! (negative Werte eingeben)

# String296
source: G-code generation was aborted! The angle of rotation must not be greater than 90° or less than -90°!
de: Die G-Code Generierung wurde abgebrochen! Der Drehwinkel darf nicht größer als 90° oder kleiner als -90° sein!

# String297
source: (Drilling position
de: ( Bohrposition

# String298
source: to drive )
de: anfahren )

# String299
source: Degree
de: Grad

# String3
source: NC-Tool (CNC cycles for drilling and milling)
de: NC-Tool (CNC Zyklen zum Bohren und Fräsen)

# String30
source: Engrave font
de: Schrift gavieren

# String300
source: ( Program: drilling pattern hole circle )
de: ( Programm: Bohrbild Lochkreis )

# String301
source: G-code generation was aborted! The drill position in table row
de: Die G-Code Generierung wurde abgebrochen! Die Bohrposition in Tabellenzeile

# String302
source: lies for X outside the working area of the machine!
de: liegt für X außerhalb des Arbeitsbereiches der Maschine!

# String303
source: lies for Y outside the working area of the machine!
de: liegt für Y außerhalb des Arbeitsbereiches der Maschine!

# String304
source: G-code generation was aborted! The diameter must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Der Durchmesser muss größer als 0 sein!

# String305
source: G-code generation was aborted! The diameter must be within the working range of the machine!
de: Die G-Code Generierung wurde abgebrochen! Der Durchmesser muss sich im Arbeitsbereiches der Maschine befinden!

# String306
source: G-code generation was aborted! The number of holes must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Die Anzahl der Bohrungen muss größer als 0 sein!

# String307
source: G-code generation was aborted! The number of holes must be less than or equal to 12!
de: Die G-Code Generierung wurde abgebrochen! Die Anzahl der Bohrungen muss kleiner oder gleich 12 sein!

# String308
source: G-code generation was aborted! The angle specification must be between 0 and 360°!
de: Die G-Code Generierung wurde abgebrochen! Die Winkelangabe muss zwischen 0 und 360° liegen!

# String309
source: ( Program: milling seal groove )
de: ( Programm: Dichtungsnut fräsen )

# String31
source: Engrave 2D DXF data
de: 2D DXF-Daten gravieren

# String310
source: G-code generation was aborted! The dimension in X must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Abmessung in X muss kleiner als der maximale Fahrweg der Maschine sein!

# String311
source: G-code generation was aborted! The dimension in Y must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Abmessung in Y muss kleiner als der maximale Fahrweg der Maschine sein!

# String312
source: G-code generation was aborted! The selected tool does not fit into the desired groove (select a smaller tool)!
de: Die G-Code Generierung wurde abgebrochen! Das ausgewählte Werkzeug passt nicht in die gewünschte Nut (kleineres Werkzeug wählen)!

# String313
source: G-code generation was aborted! The corner radius must not be larger than half the pocket width! This affects the information for 'Dimension in X' and 'Dimension in Y'!
de: Die G-Code Generierung wurde abgebrochen! Der Eckenradius darf nicht größer sein, als die halbe Taschenbreite! Dies betrifft die Angaben bei 'Abmessung in X' und 'Abmessung in Y'!

# String314
source: G-code generation was aborted! The corner radius cannot be smaller than the tool radius!
de: Die G-Code Generierung wurde abgebrochen! Der Eckenradius kann nicht kleiner als der Werkzeugradius sein!

# String315
source: G-code generation was aborted! An angle of 90° or more is no longer an inclined surface!
de: Die G-Code Generierung wurde abgebrochen! Ein Winkel ab 90° ist keine schräge Fläche mehr!

# String316
source: G-code generation was aborted! The angle doesn't make sense, the slope is larger than the dimension in Y!
de: Die G-Code Generierung wurde abgebrochen! Der Winkel macht keinen sinn, die Schräge ist größer als die Abmessung in Y!

# String317
source: G-code generation was aborted! The angle doesn't make sense, the slope is larger than the dimension in X!
de: Die G-Code Generierung wurde abgebrochen! Der Winkel macht keinen sinn, die Schräge ist größer als die Abmessung in X!

# String318
source: X direction
de: X-Richtung

# String319
source: Y direction
de: Y-Richtung

# String32
source: Post processor for:
de: Postprozessor für:

# String320
source: ( Program: sloping surface in
de: ( Programm: schräge Fläche in

# String321
source: ( Program: Milling groove )
de: ( Programm: Nut fräsen )

# String322
source: ( Twist angle =
de: ( Verdrehwinkel =

# String323
source: G-code generation was aborted! The groove width must be larger than the tool diameter!
de: Die G-Code Generierung wurde abgebrochen! Die Nutbreite muss größer als der Werkzeugdurchmesser sein!

# String324
source: G-code generation was aborted! The groove length must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Nutlänge muss kleiner als der maximale Fahrweg der Maschine sein!

# String325
source: G-code generation was aborted! The groove width must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Nutbreite muss kleiner als der maximale Fahrweg der Maschine sein!

# String326
source: G-code generation was aborted! Please check your entry: length is smaller than width!
de: Die G-Code Generierung wurde abgebrochen! Bitte Eingabe überprüfen: Länge ist kleiner als Breite!

# String327
source: G-code generation was aborted! If the side lengths are the same, please use a cycle rectangular pocket!
de: Die G-Code Generierung wurde abgebrochen! Bei gleichen Seitenlängen bitte Zyklus Rechtecktasche verwenden!

# String328
source: G-code generation was aborted! The corner radius was chosen too small for this tool!
de: Die G-Code Generierung wurde abgebrochen! Der Eckenradius wurde für dieses Werkzeug zu klein gewählt!

# String329
source: G-code generation was aborted! The corner radius must not be larger than half the groove width!
de: Die G-Code Generierung wurde abgebrochen! Der Eckenradius darf nicht größer sein, als die halbe Nutbreite!

# String33
source: Data entry in inches (G20)
de: Dateneingabe in Zoll (G20)

# String330
source: Division by zero not possible!
de: Diffision durch Null nicht möglich!

# String331
source: G-code generation was aborted! The center of the groove must be in the path of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Nutmitte muss sich im Fahrweg der Maschine befinden!

# String332
source: G-code generation was aborted! The pitch circle diameter must be larger than the tool diameter!
de: Die G-Code Generierung wurde abgebrochen! Der Teilkreisdurchmesser muss größer als der Werkzeugdurchmesser sein!

# String333
source: G-code generation was aborted! Check entry of starting angle (full circle = 360°)!
de: Die G-Code Generierung wurde abgebrochen! Eingabe Startwinkel überprüfen (Vollkreis = 360°)!

# String334
source: G-code generation was aborted! Check the opening angle entry (full circle = 360°)!
de: Die G-Code Generierung wurde abgebrochen! Eingabe Öffnungswinkel überprüfen (Vollkreis = 360°)!

# String335
source: ( Program: milling round grooves )
de: ( Programm: runde Nut fräsen )

# String336
source: ( Program: Drilling on lines )
de: ( Programm: Bohrungen auf Linien )

# String337
source: ( Program: Engrave font )
de: ( Programm: Schrift gravieren )

# String338
source: ( Letter:
de: ( Buchstabe:

# String339
source: (Program: Thread
de: ( Programm: Gewinde

# String34
source: Data entry metric (G21)
de: Dateneingabe metrisch (G21)

# String340
source: milling )
de: fräsen )

# String341
source: G-code generation was aborted! The diameter must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Der Durchmesser muss größer als 0 sein!

# String342
source: ( Program: drill deep hole )
de: ( Programm: Tiefloch bohren )

# String343
source: DXF file read successfully.
de: DXF-Datei erfolgreich eingelesen.

# String344
source: ( Program: Engrave DXF data )
de: ( Programm: DXF-Daten gravieren )

# String345
source: ( File:
de: ( Datei:

# String346
source: ( lowering )
de: ( Senken )

# String347
source: ( line )
de: ( Linie )

# String348
source: ( rectangle )
de: ( Rechteck )

# String349
source: ( circle )
de: ( Kreis )

# String35
source: Absolute dimension on (G90)
de: Absolutbemassung ein (G90)

# String350
source: ( polyline )
de: ( Polylinie )

# String351
source: ( arc )
de: ( Bogen )

# String353
source: Finished part diameter: The diameter of the finished circle pocket.
de: Fertigteildurchmesser: Der Durchmesser der fertigen Kreistasche.

# String354
source: G-code generation started...
de: G-Code Generierung gestartet ...

# String355
source: NC Tool - Memory Note!
de: NC-Tool - Speicherhinweis!

# String356
source: The configuration has been resaved. Please check the storage path for the *.nc files under: 'Program/Settings' and reset if necessary! The application starts when this message is confirmed with 'OK'.
de: Die Konfiguration wurde neu gespeichert. Bitte den Speicherpfad für die *.nc- Dateien unter: 'Programm/Einstellungen' überprüfen und gegebenenfalls neu einstellen! Die Anwendung startet wenn diese Meldung mit 'OK' bestätigt wurde.

# String357
source: The input line has no X or Y coordinates!! Unexpected input data
de: Die Eingabezeile hat keine X- als auch Y-Koordinaten!! Unerwartete Eingabedaten

# String358
source: can not be found!
de: kann nicht gefunden werden!

# String359
source: An error occurred while opening the DXF file!
de: Beim Öffnen der DXF-Datei ist ein Fehler aufgetreten!

# String36
source: Incremental dimension on (G91.1)
de: Inkrementalbemassung ein (G91.1)

# String360
source: Not enough RAM!
de: Nicht genügend Arbeitsspeicher!

# String361
source: ( thread )
de: ( Gewinde )

# String362
source: Face_milling
de: Planfräsen

# String363
source: Rectangular_pocket_roughing
de: Rechtecktasche_schruppen

# String364
source: Rectangular_pocket_finishing
de: Rechtecktasche_schlichten

# String365
source: Rectangular_tenon
de: Rechteckzapfen

# String366
source: Circle_pocket
de: Kreistasche

# String367
source: Circular_tenon
de: Kreiszapfen

# String368
source: Ring_groove
de: Ringnut

# String369
source: Drilling_table
de: Bohrtabelle

# String37
source: Constant velocity (G64)
de: konstante Geschwindigkeit (G64)

# String370
source: Drilling_pattern_hole_circle
de: Bohrbild_Lochkreis

# String371
source: Sealing_groove
de: Dichtungsnut

# String372
source: Ablines
de: Abzeilen

# String373
source: Slot_milling
de: Nut_fraesen

# String374
source: Mill_a_round_groove
de: Runde_Nut_fraesen

# String375
source: Writing
de: Schrift

# String376
source: Thread_milling
de: Gewinde_fraesen

# String377
source: G-Code Editor / Milling Path Display
de: G-Code Editor / Fräsbahnanzeige

# String378
source: Editor - NC program
de: Editor - NC-Programm

# String379
source: Line numbers enabled/disabled
de: Zeilennummern aktiviert / deaktiviert

# String38
source: Cutter radius correction off (G40)
de: Fräserradiuskorrektur aus (G40)

# String380
source: Display of the milling paths in X and Y (view from above)
de: Anzeige der Fräsbahnen in X und Y (Ansicht von Oben)

# String381
source: Selection of view
de: Auswahl der Ansicht

# String382
source: Save G code to file
de: G-Code in Datei speichern

# String383
source: Print preview
de: Druckvorschau

# String384
source: print
de: drucken

# String385
source: Close the window
de: Fenster schließen

# String386
source: Display of the milling paths in Y and Z (front view)
de: Anzeige der Fräsbahnen in Y und Z (Ansicht von Vorn)

# String387
source: Display of the milling paths in X and Z (view from the side)
de: Anzeige der Fräsbahnen in X und Z (Ansicht von der Seite)

# String388
source: G-Code file (*.nc)|*.nc|G-Code file (*.cnc)|*.cnc|Text file (*.txt)|*.txt
de: G-Code Datei (*.nc)|*.nc|G-Code Datei (*.cnc)|*.cnc|Textdatei (*.txt)|*.txt

# String389
source: Finished dimension of the cycle
de: Fertigmaß des Zyklus

# String39
source: Cutter radius correction left (G41)
de: Fräserradiuskorrektur links (G41)

# String390
source: Movements:
de: Verfahrbewegungen:

# String391
source: Movements in rapid motion
de: Bewegungen im Eilgang

# String392
source: Liniar movements with programmed feed
de: Liniarbewegungen mit programmiertem Vorschub

# String393
source: Circular movements with programmed feed
de: Kreisbewegungen mit programmiertem Vorschub

# String394
source: Milling path display in X and Y directions
de: Fräsbahnanzeige in X und Y-Richtung

# String395
source: Milling path display in Y and Z directions
de: Fräsbahnanzeige in Y und Z-Richtung

# String396
source: Milling path display in X and Z directions
de: Fräsbahnanzeige in X und Z-Richtung

# String399
source: Programming: 2022 - 2024
de: Programmierung: 2022 - 2024

# String40
source: Cutter radius correction right (G42)
de: Fräserradiuskorrektur rechts (G42)

# String401
source: Description: NC-Tool provides simple cycles for milling and drilling common shapes. Graphical input masks and assistance make it easier to create simple ones Milling programs for home use. The output is in standard G code!
de: Beschreibung: NC-Tool stellt einfache Zyklen für das Fräsen und das Bohren von gängigen Formen zur Verfügung. Dabei erleichtern grafische Eingabemasken und Hilfestellungen das Erstellen von einfachen Fräsprogrammen für die Heimanwendung. Die Ausgabe erfolgt im Standard G-Code!

# String402
source: Information: 1. The cycles are based on those from Heidenhain, but have been completely reprogrammed and optimized. Milling is always done in synchronism and there is no need for pre-drilling in pockets because the tools travel to the infeed depth on a helical path. 2. For the 'Writing' cycle I took inspiration from 'dingolovethrob'. https://drive.google.com/drive/folders/1nEmfoT8EGrREhB8wdw893vRD0nuCrPLf 3. For the cycle 'Engrave DXF data' I took inspiration from 'Evren DAGLIOGLU' fetched. Project: 'DXFImporter' / E-mail: evrenda@yahoo.com 4. This project is open source (GPL 3.0 license). Please discuss any major changes with me or inform me. E-mail: petervoigt.dipps@gmx.de
de: Informationen: 1. Die Zyklen sind denen von Heidenhain nachempfunden, wurden aber komplett neu programmiert und optimiert. Es wird immer im Gleichlauf gefräst und bei Taschen entfällt das Vorbohren, da die Werkzeuge auf einer Helixbahn in die Zustelltiefe fahren. 2. Bei dem Zyklus 'Schrift' habe ich mir Inspiration von 'dingolovethrob' geholt. https://drive.google.com/drive/folders/1nEmfoT8EGrREhB8wdw893vRD0nuCrPLf 3. Bei dem Zyklus 'DXF Daten gravieren' habe ich mir Inspiration von 'Evren DAGLIOGLU' geholt. Projekt: 'DXFImporter' / E-mail: evrenda@yahoo.com 4. Dieses Projekt ist Open Source (GPL-3.0 -Lizenz). Größere Veränderungen bitte mit mir absprechen, bzw. mich informieren. E-mail: petervoigt.dipps@gmx.de

# String403
source: Drilling matrix
de: Bohrmatrix

# String404
source: Deep hole drilling
de: Tieflochbohrung

# String405
source: File is loading.
de: Datei wird geladen.

# String406
source: License
de: Lizenz

# String41
source: Maximum processing paths of the machine in mm
de: maximale Verarbeitungswege der Maschine in mm

# String42
source: Maximum feed in X/YZ in mm/min
de: maximaler Vorschub in X/YZ in mm/min

# String43
source: Absolute safety height before cycle start in mm
de: Absolute Sicherheitshöhe vor Zyklenbeginn in mm

# String44
source: Storage path for *.nc files
de: Speicherpfad für *.nc Dateien

# String45
source: save and close
de: speichern und schließen

# String46
source: cancel
de: abbrechen

# String47
source: Face milling in X and Y directions
de: Planfräsen in X und Y-Richtung

# String48
source: Discard (default values)
de: Verwerfen (Standardwerte)

# String49
source: Generate G code
de: G-Code erzeugen

# String5
source: Language
de: Sprache

# String50
source: Mill a rectangular pocket
de: Rechtecktasche fräsen

# String51
source: Milling square tenons
de: Rechteckzapfen fräsen

# String52
source: Mill a circular pocket
de: Kreistasche fräsen

# String53
source: Milling circular tenons
de: Kreistzapfen fräsen

# String54
source: Mill ring groove
de: Ringnut fräsen

# String55
source: Mill sealing groove (rectangular).
de: Dichtungsnut (rechteckig) fräsen

# String56
source: Mill bevels in the X or Y direction
de: Schrägen in X oder Y-Richtung fräsen

# String57
source: Engrave writing (text)
de: Schrift (Text) gravieren

# String58
source: Deep hole drilling (with removal)
de: Tiefloch bohren (mit ausspanen)

# String59
source: Cutter diameter (mm)
de: Fräserdurchmesser (mm)

# String6
source: about
de: über

# String60
source: Drill diameter (mm)
de: Bohrerdurchmesser (mm)

# String61
source: Spindle speed in rpm
de: Spindeldrehzahl in U/min

# String62
source: method
de: Methode

# String63
source: from outside to inside
de: von Außen nach Innen

# String64
source: lines from Y=0 to Y+
de: abzeilen von Y=0 nach Y+

# String65
source: Feed infeed mm/min
de: Vorschub Zustellung mm/min

# String66
source: Milling feed in mm/min
de: Vorschub Fräsen in mm/min

# String67
source: Safety distance (mm)
de: Sicherheits-Abstand (mm)

# String68
source: Final depth in Z (mm)
de: Finale Tiefe in Z (mm)

# String69
source: Infeed in Z (mm)
de: Zustellung in Z (mm)

# String7
source: Cycles
de: Zyklen

# String70
source: Dimension in X (mm)
de: Abmessung in X (mm)

# String71
source: Dimension in Y (mm)
de: Abmessung in Y (mm)

# String74
source: Corner radius R in mm
de: Eckenradius R in mm

# String75
source: just smooth it out
de: nur schlichten

# String76
source: Finishing allowance in X/Y (mm)
de: Schlichtaufmass in X/Y (mm)

# String77
source: Angle in degrees
de: Winkel in Grad

# String78
source: milling side
de: Frässeite

# String79
source: Click on the page! ->
de: Seite anklicken! ->

# String8
source: Surface processing
de: Flächenbearbeitung

# String80
source: Oversize raw part in Y (mm)
de: Aufmaß Rohteil in Y (mm)

# String81
source: Oversize raw part in X (mm)
de: Aufmaß Rohteil in X (mm)

# String82
source: Diameter of raw part (mm)
de: Durchmesser Rohteil (mm)

# String83
source: Diameter finished part (mm)
de: Durchmesser Fertigteil (mm)

# String84
source: Angle of rotation in degrees
de: Verdrehwinkel in Grad

# String85
source: Inner diameter (mm)
de: Innendurchmesser (mm)

# String86
source: Outer diameter (mm)
de: Außendurchmesser (mm)

# String87
source: Groove width in mm
de: Nutbreite in mm

# String88
source: Delete drilling table
de: Bohrtabelle löschen

# String89
source: Chipping depth (mm)
de: Ausspantiefe (mm)

# String9
source: Standard drilling/thread milling
de: Standardbohren / Gewinde fräsen

# String90
source: Retraction in case of chip breakage (mm)
de: Rückzug bei Spanbruch (mm)

# String91
source: Drilling depth chip breakage (mm)
de: Bohrtiefe Spanbruch (mm)

# String92
source: Infeed depth (mm)
de: Zustelltiefe (mm)

# String93
source: Drilling depth (mm)
de: Bohriefe (mm)

# String95
source: Retraction when chip breaks (mm)
de: Rückzug bei Spanbruch (mm)

# String96
source: Start angle in degrees
de: Startwinkel in Grad

# String97
source: Number of holes
de: Anzahl der Bohrungen

# String98
source: Hole circle diameter (mm)
de: Lochkreis Durchmesser (mm)

# String99
source: Number of rows
de: Anzahl der Zeilen
