Repository: NcPeter/NC_Tool
Catalog: Languages/*_Lang.resx
Languages: de

# String1
source: Close
de: Beenden

# String10
source: Bags
de: Taschen

# String100
source: Number of columns
de: Anzahl der Spalten

# String101
source: Dist. Y
de: Abst. Y

# String102
source: Dist. X
de: Abst. X

# String105
source: Drilling pattern on lines
de: Bohrbild auf Linien

# String106
source: Opening angle in degrees
de: Öffnungswinkel in Grad

# String107
source: Side length (mm)
de: Seitenlänge (mm)

# String108
source: Pitch circle diameter (mm)
de: Teilkreisdurchmesser (mm)

# String109
source: Center in Y (mm)
de: Mitte in Y (mm)

# String11
source: Tenon
de: Zapfen

# String110
source: Center in X (mm)
de: Mitte in X (mm)

# String111
source: Typeface
de: Schriftart

# String112
source: Font height in mm
de: Schrifthöhe in mm

# String113
source: Input text
de: Eingabetext

# String114
source: External thread
de: Außengewinde

# String115
source: Inner thread
de: Innengewinde

# String116
source: Thread diameter (mm)
de: Gewindedurchmesser (mm)

# String117
source: Offset in -Z (mm)
de: Versatz in -Z (mm)

# String118
source: Thread depth (mm)
de: Gewindetiefe (mm)

# String119
source: Thread pitch
de: Gewindesteigung

# String12
source: Milling grooves
de: Nuten fräsen

# String120
source: Display ellipses as polylines
de: Ellipsen als Polyline darstellen

# String121
source: Open file
de: Datei öffnen

# String122
source: Grooves
de: Nuten

# String123
source: Face milling of a surface with programmed feed in lines over the workpiece. 1. The machine moves the tool to the starting point. 2. The tool is then moved in Z with programmed infeed. 3. The outer edges are processed. 4. The surface is lined. 5. The tool is then returned to the starting point. This process is repeated until the desired depth is reached.
de: Planfräsen einer Oberfläche mit programmiertem Vorschub Zeilenförmig über das Werkstück. 1. Die Maschine fährt das Werkzeug zum Startpunkt. 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren. 3. Die Außenkanten werden bearbeitet. 4. Die Oberfläche wird abgezeilt. 5. Danach wird das Werkzeug zum Startpunkt zurück geführt. Dieser Vorgang wiederholt sich, bis die gewünschte Tiefe erreicht ist.

# String124
source: Safety distance: Distance between tool tip and workpiece surface for positioning on At the beginning of the cycle and at the end of the cycle.
de: Sicherheits-Abstand: Abstand zwischen Werkzeugspitze und Werkstückoberfläche für die Positionierung am Zyklus-Anfang und am Zyklus-Ende.

# String125
source: Final depth: The depth to which the surface should be milled.
de: Finale Tiefe: Die Tiefe, auf die die Fläche gefräst werden soll.

# String126
source: Delivery in Z: The maximum amount by which the tool is advanced.
de: Zustellung in Z: Maß, um welches das Werkzeug jeweils maximal zugestellt wird.

# String127
source: Feed delivery: Travel speed of the tool when moving from the safety distance to the Milling depth in mm/min.
de: Vorschub Zustellung: Verfahrgeschwindigkeit des Werkzeugs beim Fahren vom Sicherheits-Abstand auf die Frästiefe in mm/min.

# String128
source: Dimension in X direction: The dimension of the raw material or the surface to be processed from the zero point in the X direction.
de: Abmessung in X-Richtung: Die Abmessung des Rohmaterial bzw. der zu bearbeitenden Fläche vom Nullpunkt in X-Richtung.

# String129
source: Dimension in Y direction: The dimension of the raw material or the surface to be processed from the zero point in the Y direction.
de: Abmessung in Y-Richtung: Die Abmessung des Rohmaterial bzw. der zu bearbeitenden Fläche vom Nullpunkt in Y-Richtung.

# String13
source: Drilling patterns
de: Bohrbilder

# String130
source: Milling feed: Traversing speed of the tool during milling in mm/min.
de: Vorschub fräsen: Verfahrgeschwindigkeit des Werkzeugs beim Fräsen in mm/min.

# String131
source: Mill inclined surfaces with programmed feeds and dimensions. 1. The machine moves the tool to the zero point and offsets it then to the starting point, which depends on the surface to be milled. 2. The tool is then moved in Z with programmed infeed. 3. The sloping surface is then leveled off, removing any remaining material. 4. After each movement in X or Y, there is another infeed in Z, up to the final depth. Tip: Infeed in Z determines the gradation of the area. Use radius or ball end mill.
de: Schräge Flächen mit programmierten Vorschüben und Abmessungen fräsen. 1. Die Maschine fährt das Werkzeug zum Nullpunkt und versetzt dann zum Startpunkt, welcher von der zu fräsenden Fläche abhängt. 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren. 3. Danach wird die schräge Fläche abgezeilt, wobei Restmaterial mit entfernt wird. 4. Nach jeder Bewegung in X oder Y erfolgt wieder eine Zustellung in Z, bis zur finalen Tiefe. Tip: Zustellung in Z bestimmt die Abstufung der Fläche. Radius oder Kugelfräser verwenden.

# String132
source: Dimension in X direction: The dimensions of the material or the milling direction in X.
de: Abmessung in X-Richtung: Die Abmessung des Materials, bzw. der Fräsrichtung in X.

# String133
source: Dimension in Y direction: The dimensions of the material or the milling direction in Y.
de: Abmessung in Y-Richtung: Die Abmessung des Materials, bzw. der Fräsrichtung in Y.

# String134
source: Angle: Enter the angle of the inclined surface in degrees here. Always specify starting from a right angle (90°) to the workpiece!
de: Winkel: Hier den Winkel der schrägen Fläche in Grad eingeben. Immer ausgehend vom rechten Winkel (90°) zum Werkstück hin angeben!

# String135
source: Milling direction in X
de: Fräsrichtung in X

# String136
source: Milling direction in Y
de: Fräsrichtung in Y

# String137
source: Drill a deep hole. 1. The machine moves the tool to the starting point. 2. The tool is then moved in Z with programmed infeed, Only one programmed infeed is ever drilled. The drill is then raised to break the chip. From a certain depth, the drill is raised to remove the material. This process is repeated until the desired depth is reached.
de: Tiefloch bohren. 1. Die Maschine fährt das Werkzeug zum Startpunkt. 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren, dabei wird immer nur eine programmierte Zustellung gebohrt. Der Bohrer wird danach zum Spanbruch angehoben. Ab einer bestimmten Tiefe wird der Bohrer zusätzlich zum ausspanen angehoben. Dieser Vorgang wiederholt sich, bis die gewünschte Tiefe erreicht ist.

# String138
source: Drilling depth: The depth from the workpiece surface (Z = 0) to the drill tip.
de: Bohriefe: Die Tiefe von Werkstückoberfläche (Z = 0) bis Bohrerspitze.

# String139
source: Feed delivery: Travel speed of the tool when moving from the safety distance to the Drilling depth in mm/min.
de: Vorschub Zustellung: Verfahrgeschwindigkeit des Werkzeugs beim Fahren vom Sicherheits-Abstand auf die Bohrtiefe in mm/min.

# String14
source: Special cycles
de: Sonderzyklen

# String140
source: Drilling depth chip breakage: Infeed in Z, after which a chip break is carried out.
de: Bohrtiefe Spanbruch: Zustellung in Z, nach der ein Spanbruch durchgeführt wird.

# String141
source: Retraction until chip breakage: Value by which the tool moves back after chip breaking.
de: Rückzug bis Spanbruch: Wert, um den das Werkzeug nach Spanbrechen zurückfährt.

# String142
source: Spout depth: From this depth onwards, the system moves back to 2mm below Z=0 after each infeed.
de: Ausspantiefe: Ab dieser Tiefe wird nach jeder Zustellung bis 2mm unter Z=0 ausgespant.

# String143
source: Middle in X: The distance of the hole in the X direction from the touch point. Can also receive negative values.
de: Mitte in X: Der Abstand der Bohrung in X-Richtung vom Antastpunkt. Kann auch negative Werte erhalten.

# String144
source: Middle in Y: The distance of the hole in the Y direction from the touch point. Can also receive negative values.
de: Mitte in Y: Der Abstand der Bohrung in Y-Richtung vom Antastpunkt. Kann auch negative Werte erhalten.

# String145
source: Workpiece length in X: The length in the X direction from the touch point.
de: Werstücklänge in X: Die Länge in X-Richtung vom Antastpunkt.

# String146
source: Workpiece width in Y: The width in the Y direction from the touch point.
de: Werstückbreite in Y: Die Breite in Y-Richtung vom Antastpunkt.

# String147
source: Mill a metric internal thread. 1. The machine moves the tool to the center of the thread. 2. The lowering process is carried out first. 3. The thread is then machined with programmed feed. and depth milled out with a helix track. 4. The tool is then returned to the starting point.
de: Ein Metrisches Innengewinde fräsen. 1. Die Maschine fährt das Werkzeug zum Mittelpunkt des Gewindes. 2. Als erstes wird der Senkvorgang ausgeführt. 3. Danach wird das Gewinde mit programmiertem Vorschub. und Tiefe mit einer Helixbahn ausgefräst. 4. Anschließend wird das Werkzeug zum Startpunkt zurück geführt.

# String148
source: Mill a metric external thread. 1. The machine moves the tool to the center of the thread. 2. Then offset in X (radius + safety distance). 3. The thread is then machined with programmed feed. and depth milled with a helix track. 4. The tool is then returned to the starting point.
de: Ein Metrisches Aussengewinde fräsen. 1. Die Maschine fährt das Werkzeug zum Mittelpunkt des Gewindes. 2. Versetzt dann in X (Radius + Sicherheitsabstand). 3. Danach wird das Gewinde mit programmiertem Vorschub. und Tiefe mit einer Helixbahn gefräst. 4. Anschließend wird das Werkzeug zum Startpunkt zurück geführt.

# String149
source: Thread diameter: Freely selectable if it fits the thread pitch.
de: Gewindedurchmesser: Frei wählbar, wenn es mit der Steigung passt.

# String15
source: Face milling
de: Planfräsen

# String150
source: Thread: Distance from thread gear to thread gear. Corresponds to immersion in Z- in mm per revolution.
de: Gewindesteigung: Abstand von Gewindegang zu Gewindegang. Entspricht dem Eintauchen in Z- in mm pro Umdrehung.

# String151
source: Final depth: The depth to which the thread should be milled. Pre-drilling to (depth + 2mm) is recommended! Ideally, a drill bit that matches the core diameter is used.
de: Finale Tiefe: Die Tiefe auf die das Gewinde gefräst werden soll. Es wird ein Vorbohren auf (Tiefe + 2mm) empfohlen! Idealerweise wird ein Bohrer verwendet, der dem Kerndurchmesser entspricht.

# String152
source: Offset in Z-: Distance between workpiece surface and thread. For example, a thread in a bag.
de: Versatz in Z-: Abstand zwischen Werkstückoberfläche und Gewinde. Zum Beispiel bei einem Gewinde in einer Tasche.

# String153
source: Middle in X: The distance of the thread in the X direction from the probing point.
de: Mitte in X: Der Abstand des Gewindes in X-Richtung vom Antastpunkt.

# String154
source: Middle in Y: The distance of the thread in the Y direction from the probing point.
de: Mitte in Y: Der Abstand des Gewindes in Y-Richtung vom Antastpunkt.

# String155
source: Mill a rectangular pocket with programmed feeds and dimensions. 1. The machine moves the tool to the starting point (middle of the pocket). 2. The tool is then moved in Z with programmed infeed. An oscillating movement in X or Y is carried out. 3. The bag is then emptied from the inside out. 4. The tool is then returned to the starting point. This process is repeated until the desired depth is reached.
de: Eine Rechtecktasche mit programmierten Vorschüben und Abmessungen fräsen. 1. Die Maschine fährt das Werkzeug zum Startpunkt (Taschenmitte). 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren. Dabei wird eine pendelnde Bewegung in X oder Y ausgeführt. 3. Danach wird die Tasche von Innen nach Außen ausgeräumt. 4. Anschließend wird das Werkzeug zum Startpunkt zurück geführt. Dieser Vorgang wiederholt sich, bis die gewünschte Tiefe erreicht ist.

# String156
source: Final depth: The depth to which the rectangular pocket should be milled.
de: Finale Tiefe: Die Tiefe auf die die Rechtecktasche gefräst werden soll.

# String157
source: Dimension in X: The dimension of the pocket in the X direction.
de: Abmessung in X: Die Abmessung der Tasche in X-Richtung.

# String158
source: Dimension in Y: The dimension of the pocket in the Y direction.
de: Abmessung in Y: Die Abmessung der Tasche in Y-Richtung.

# String159
source: Corner radius: Mill corner radius. The corner radius will always correspond to the tool radius if the specified value is less than or equal to the tool radius.
de: Eckenradius: Eckenradius fräsen. Der Eckenradius wird immer dem Werkzeugradius entsprechen wenn der angegebene Wert kleiner oder gleich dem Werkzeugradius ist.

# String16
source: Bevel/Chamfer
de: Schräge / Fase

# String160
source: just finished: If this option is selected, there is no need to empty the bag. The program assumes that there is no more material inside the bag. Only the dimension in X/Y specified under 'Finishing allowance' is removed. The machine positions the tool just in front of the wall + finishing allowance.
de: nur schlichten: Ist diese Option gewählt, entfällt das Ausräumen der Tasche. Das Programm nimmt an, im Inneren der Tasche befindet sich kein Material mehr. Es wird nur das bei 'Schlichtaufmaß' angegebene Maß in X/Y entfernt. Dabei positioniert die Maschine das Werkzeug kurz vor der Wandung + Schlichtaufmaß.

# String161
source: Finishing allowance: The finishing allowance indicates how much material is removed from the wall of the pocket must be removed in X and Y in order to obtain the desired finished size of the bag.
de: Schlichtaufmaß: Mit dem Schlichtaufmaß wird angegeben, wie viel Material von der Wand der Tasche in X und Y entfernt werden muss um das gewünsche Fertigmaß der Tasche zu erhalten.

# String162
source: Mill a rectangular tenon with programmed feeds and dimensions. 1. A corresponding amount of raw material must be removed around the tenon, (Indicating the allowance for the raw part), the machine moves the tool to the corresponding starting point to remove the raw material around the tenon. 2. The tenon is then milled to the desired dimensions. 3. The tool is then returned to the starting point. This process is repeated until the desired depth is reached.
de: Einen Rechteckzapfen mit programmierten Vorschüben und Abmessungen fräsen. 1. Muss entsprechend viel Rohmaterial um den Zapfen entfernt werden, (Angabe Aufmaß Rohteil) fährt die Maschine das Werkzeug zum entsprechenden Startpunkt um das Rohmaterial um den Zapfen zu entfernen. 2. Danach wird der Zapfen auf die gewünschten Maße gefräst. 3. Anschließend wird das Werkzeug zum Startpunkt zurück geführt. Dieser Vorgang wiederholt sich, bis die gewünschte Tiefe erreicht ist.

# String163
source: Oversize raw part in X (mm)
de: Aufmaß Rohteil in X (mm)

# String164
source: Oversize raw part in Y (mm)
de: Aufmaß Rohteil in Y (mm)

# String165
source: Final depth: The depth to which the rectangular tenon should be milled.
de: Finale Tiefe: Die Tiefe auf die der Rechteckzapfen gefräst werden soll.

# String166
source: Dimension in X: The dimension of the tenon in the X direction.
de: Abmessung in X: Die Abmessung des Zapfen in X-Richtung.

# String167
source: Dimension in Y: The dimension of the tenon in the Y direction.
de: Abmessung in Y: Die Abmessung des Zapfen in Y-Richtung.

# String168
source: Corner radius: Mill corner radius. If no corner radius is specified (entry = 0), the tenon has sharp edges.
de: Eckenradius: Eckenradius fräsen. Wird kein Eckenradius angegeben (Eingabe = 0), wird der Zapfen scharfkantig ausgeführt.

# String169
source: Measurement of raw part in X: The allowance for the blank indicates how much material must be removed per side in X in order to obtain the desired finished dimension of the tenon. Is always >= 0. Enter the largest dimension of a side here! Tip: Just finish the tenon, enter the allowance for a small tool radius.
de: Aufmaß Rohteil in X: Mit dem Aufmaß für das Rohteil wird angegeben, wie viel Material pro Seite in X entfernt werden muss, um das gewünsche Fertigmaß des Zapfen zu erhalten. Ist immer >= 0. Hier das größte Aufmaß einer Seite eingeben! Tipp: Zapfen nur schlichten, Aufmaß kleiner Werkzeugradius eingeben.

# String17
source: Drill a deep hole
de: Tiefloch bohren

# String170
source: Measurement of raw part in Y: The allowance for the blank indicates how much material must be removed per side in Y in order to obtain the desired finished dimension of the tenon. Is always >= 0. Enter the largest dimension of a side here! Tip: Just finish the tenon, enter the allowance for a small tool radius.
de: Aufmaß Rohteil in Y: Mit dem Aufmaß für das Rohteil wird angegeben, wie viel Material pro Seite in Y entfernt werden muss, um das gewünsche Fertigmaß des Zapfen zu erhalten. Ist immer >= 0. Hier das größte Aufmaß einer Seite eingeben! Tipp: Zapfen nur schlichten, Aufmaß kleiner Werkzeugradius eingeben.

# String171
source: Diameter of raw part (mm)
de: Durchmesser Rohteil (mm)

# String172
source: Diameter finished part (mm)
de: Durchmesser Fertigteil (mm)

# String173
source: Final depth: The depth to which the circular pocket should be milled.
de: Finale Tiefe: Die Tiefe auf die die Kreistasche gefräst werden soll.

# String174
source: just finished: If this option is selected, there is no need to empty the bag. The program assumes that there is no more material inside the bag. Only the dimension in X/Y specified under 'Diameter of raw part' is removed. The machine positions the tool just in front of the wall + finishing allowance.
de: nur schlichten: Ist diese Option gewählt, entfällt das Ausräumen der Tasche. Das Programm nimmt an, im Inneren der Tasche befindet sich kein Material mehr. Es wird nur das bei 'Druchmesser Rohteil' angegebene Maß in X/Y entfernt. Dabei positioniert die Maschine das Werkzeug kurz vor der Wandung + Schlichtaufmaß.

# String175
source: Diameter of raw part: The diameter of the raw part indicates how much material must be removed from the wall of the pocket in order to obtain the desired finished diameter of the pocket. This parameter only needs to be specified if 'finish only' is enabled. Note: For raw part diameters smaller than 3 * milling cutter diameter, roughing is carried out first!
de: Druchmesser Rohteil: Mit dem Druchmesser Rohteil wird angegeben, wie viel Material von der Wand der Tasche entfernt werden muss um den gewünschen Fertigdurchmesser der Tasche zu erhalten. Dieser Parameter muss nur angegeben werden, wenn 'nur schlichten' aktiviert ist. Hinweis: Bei Rohteildurchmesser kleiner 3 * Fräserdurchmesser wird zuerst geschruppt!

# String176
source: Final depth: The depth to which the circular spigot should be milled.
de: Finale Tiefe: Die Tiefe auf die der Kreiszapfen gefräst werden soll.

# String177
source: Diameter of raw part: The diameter of the raw part indicates how much material must be removed from the wall of the tenon in order to obtain the desired finished diameter.
de: Druchmesser Rohteil: Mit dem Druchmesser Rohteil wird angegeben, wie viel Material von der Wand des Zapfen entfernt werden muss um den gewünschen Fertigdurchmesser zu erhalten.

# String178
source: Finished part diameter: The diameter of the finished circular spigot.
de: Fertigteildurchmesser: Der Durchmesser des fertigen Kreiszapfen.

# String179
source: Measurement of raw part in X: If an allowance is specified for the blank, this material is removed per side in X down to the milling depth around the tenon. First a rectangular tenon is milled and then the circular tenon. Specifying 0 in the X and Y directions switches this option off!
de: Aufmaß Rohteil in X: Wird ein Aufmaß für das Rohteil wird angegeben, wird dieses Material pro Seite in X bis auf die Frästiefe um den Zapfen entfernt. Es wird zunächst ein Rechteckzapfen und danach der Kreiszapfen gefräst. Eine Angabe von 0 in X und Y Richtung, schaltet diese Option aus!

# String18
source: Milling threads
de: Gewinde fräsen

# String180
source: Measurement of raw part in Y: If an allowance is specified for the blank, this material is removed per side in Y down to the milling depth around the tenon. First a rectangular tenon is milled and then the circular tenon. Specifying 0 in the X and Y directions switches this option off!
de: Aufmaß Rohteil in Y: Wird ein Aufmaß für das Rohteil wird angegeben, wird dieses Material pro Seite in Y bis auf die Frästiefe um den Zapfen entfernt. Es wird zunächst ein Rechteckzapfen und danach der Kreiszapfen gefräst. Eine Angabe von 0 in X und Y Richtung, schaltet diese Option aus!

# String181
source: Mill a groove with programmed feeds and dimensions. 1. The machine moves the tool to the starting point (center of the groove). 2. The tool is then moved in Z with programmed infeed. An oscillating movement in X or Y is carried out. 3. The groove on the contour is then cleared out. 4. The tool is then returned to the starting point. This process is repeated until the desired depth is reached.
de: Eine Nut mit programmierten Vorschüben und Abmessungen fräsen. 1. Die Maschine fährt das Werkzeug zum Startpunkt (Nutnmitte). 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren. Dabei wird eine pendelnde Bewegung in X oder Y ausgeführt. 3. Danach wird die Nut an der Kontur ausgeräumt. 4. Anschließend wird das Werkzeug zum Startpunkt zurück geführt. Dieser Vorgang wiederholt sich, bis die gewünschte Tiefe erreicht ist.

# String182
source: Twist angle in degrees
de: Verdrehwinkel in Grad

# String183
source: Final depth: The depth to which the groove should be milled.
de: Finale Tiefe: Die Tiefe auf die die Nut gefräst werden soll.

# String184
source: Dimension in X: The dimension of the groove in the X direction.
de: Abmessung in X: Die Abmessung der Nut in X-Richtung.

# String185
source: Dimension in Y: The dimension of the groove in the Y direction.
de: Abmessung in Y: Die Abmessung der Nut in Y-Richtung.

# String186
source: Twist angle: This allows the groove to be rotated in position at a certain angle. Positive values rotate counterclockwise, negative values rotate clockwise.
de: Verdrehwinkel: Damit kann die Nut mit in einem bestimmten Winkel in ihrer Lage verdreht werden. Positive Werte drehen gegen Uhrzeigersinn, negative Werte im Uhrzeigersinn.

# String187
source: Mill a circular pocket with programmed feeds and dimensions. 1. The machine moves the tool to the starting point (middle of the pocket). 2. The tool is then moved in Z with programmed infeed. A circular movement in X and Y (helix) is carried out. 3. The bag is then emptied from the inside out. 4. The tool is then returned to the starting point. This process is repeated until the desired depth is reached.
de: Eine Kreistasche mit programmierten Vorschüben und Abmessungen fräsen. 1. Die Maschine fährt das Werkzeug zum Startpunkt (Taschenmitte). 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren. Dabei wird eine kreisförmige Bewegung in X und Y (Helix) ausgeführt. 3. Danach wird die Tasche von Innen nach Außen ausgeräumt. 4. Anschließend wird das Werkzeug zum Startpunkt zurück geführt. Dieser Vorgang wiederholt sich, bis die gewünschte Tiefe erreicht ist.
