Repository: NcPeter/NC_Tool
Catalog: Languages/*_Lang.resx
Languages: de

# String188
source: Mill a circular spigot with programmed feeds and dimensions. 1. If a corresponding amount of raw material has to be removed around the tenon, (specify the allowance for the raw part), the machine moves the tool to the corresponding starting point in order to remove the raw material around the tenon. 2. A rectangular tenon is first milled, which is then finished into a circular tenon. Without a specification in the 'Oversize blank', only the tenon will be trimmed from the diameter of the blank to the finished part.
de: Einen Kreiszapfen mit programmierten Vorschüben und Abmessungen fräsen. 1. Muss entsprechend viel Rohmaterial um den Zapfen entfernt werden, (Angabe Aufmaß Rohteil) fährt die Maschine das Werkzeug zum entsprechenden Startpunkt um das Rohmaterial um den Zapfen zu entfernen. 2. Dabei wird zunächst ein Rechteckzapfen gefräst, der anschließend zu einem Kreiszapfen geschlichtet wird. Ohne eine Angabe bei 'Aufmaß Rohteil' wird nur der Zapfen von den Durchmessern Rohteil zu Fertigteil geschlichtet.

# String189
source: Mill an annular groove with programmed feeds and dimensions. 1. The machine moves the tool to the zero point (middle of the ring groove) and then moves it to the starting point (edge of the inner diameter). 2. The tool is then moved in Z with programmed infeed. A circular movement in X and Y (helix) is carried out. 3. The annular groove is then cleared out to the edge of the outer diameter. 4. The tool is then returned to the starting point.
de: Eine Ringnut mit programmierten Vorschüben und Abmessungen fräsen. 1. Die Maschine fährt das Werkzeug zum Nullpunkt (Mitte Ringnut) und versetzt dann zum Startpunkt (Rand des Innendurchmesser). 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren. Dabei wird eine kreisförmige Bewegung in X und Y (Helix) ausgeführt. 3. Danach wird die Ringnut bis an den Rand des Außendurchmesser ausgeräumt. 4. Anschließend wird das Werkzeug zum Startpunkt zurück geführt.

# String19
source: Rectangle bag
de: Rechtecktasche

# String190
source: Process a drilling table with programmed drilling positions. 1. The machine moves the tool in rapid traverse and at a safety distance, from the zero point to the first drilling position in the drilling table. 2. Then drill at this point with programmed feed and depth. 3. The tool is then moved again to the safety distance and the next position in the drilling table is approached in rapid traverse. Tip: Simply leave positions in the table that are not required blank.
de: Eine Bohrtabelle mit programmierten Bohrpositionen abarbeiten. 1. Die Maschine fährt das Werkzeug im Eilgang und im Sicherheitsabstand, vom Nullpunkt zur ersten Bohrposition der Bohrtabelle. 2. Danach wird an diese Stelle mit programmiertem Vorschub und Tiefe gebohrt. 3. Anschließend wird das Werkzeug wieder auf Sicherheitsabstand verfahren und die nächste Position in der Bohrtabelle im Eilgang angefahren. Tip: Nicht benötigte Positionen der Tabelle einfach frei lassen.

# String191
source: Drill a number of holes arranged on a diameter. 1. The machine moves the tool in rapid traverse and at a safety distance, from the zero point to the first drilling position on the hole circle. 2. Then drill at this point with programmed feed and depth. 3. The tool is then moved again to the safety distance and the next position on the hole circle is approached in rapid traverse. This process is repeated until all holes on the bolt circle have been drilled.
de: Eine Anzahl von Bohrungen, auf einem Durchmesser angeordnet, bohren. 1. Die Maschine fährt das Werkzeug im Eilgang und im Sicherheitsabstand, vom Nullpunkt zur ersten Bohrposition auf dem Lochkreis. 2. Danach wird an diese Stelle mit programmiertem Vorschub und Tiefe gebohrt. 3. Anschließend wird das Werkzeug wieder auf Sicherheitsabstand verfahren und die nächste Position auf dem Lochkreis im Eilgang angefahren. Dieser Vorgeng wiederholt sich, bis alle Löcher auf dem Lochkreis gebohrt sind.

# String192
source: Mill a seal groove with programmed feeds and dimensions. 1. The machine moves the tool to the zero point (middle of the groove) and then moves it to the starting point (inner edge of the contour). 2. The tool is then moved in Z with programmed infeed. An oscillating movement in X or Y is carried out. 3. The groove is then cleared out to the edge of the outer contour. 4. The tool is then returned to the starting point.
de: Eine Dichtungsnut mit programmierten Vorschüben und Abmessungen fräsen. 1. Die Maschine fährt das Werkzeug zum Nullpunkt (Mitte Nut) und versetzt dann zum Startpunkt (innerer Rand der Kontur). 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren. Dabei wird eine pendelnde Bewegung in X oder Y ausgeführt. 3. Danach wird die Nut bis an den Rand der Außenkontur ausgeräumt. 4. Anschließend wird das Werkzeug zum Startpunkt zurück geführt.

# String193
source: Drill a number of holes arranged in rows and columns. 1. The machine moves the tool in rapid traverse and at a safety distance to the first drilling position. 2. Then drill at this point with programmed feed and depth. 3. The tool is then moved again to the safety distance and the next drilling position is approached in rapid traverse. This process is repeated until all holes have been drilled.
de: Eine Anzahl von Bohrungen, in Zeilen und Spalten angeordnet, bohren. 1. Die Maschine fährt das Werkzeug im Eilgang und im Sicherheitsabstand zur ersten Bohrposition. 2. Danach wird an diese Stelle mit programmiertem Vorschub und Tiefe gebohrt. 3. Anschließend wird das Werkzeug wieder auf Sicherheitsabstand verfahren und die nächste Bohrposition im Eilgang angefahren. Dieser Vorgeng wiederholt sich, bis alle Bohrungen gebohrt sind.

# String194
source: Mill a letter or lettering. 1. The machine moves the tool to the starting point (1st letter). 2. The tool is then moved in Z with programmed infeed. 3. The letter or lettering is then milled in a center path (font width = milling cutter diameter). 4. The tool is then returned to the starting point. This process is repeated until the desired depth is reached.
de: Einen Buchstaben oder einen Schriftzug fräsen. 1. Die Maschine fährt das Werkzeug zum Startpunkt (1. Buchstabe). 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren. 3. Danach wird der Buchstabe oder der Schriftzug in einer Mittel-. punktsbahn gefräst (Schriftbreite = Fräserdurchmesser). 4. Anschließend wird das Werkzeug zum Startpunkt zurück geführt. Dieser Vorgang wiederholt sich, bis die gewünschte Tiefe erreicht ist.

# String195
source: Engrave 2D DXF data. 1. The machine moves the tool to the starting point. 2. The tool is then moved in Z with programmed infeed. 3. The individual elements are then milled in a center path. 4. The tool is then returned to the starting point.
de: 2D DXF-Daten gravieren. 1. Die Maschine fährt das Werkzeug zum Startpunkt. 2. Das Werkzeug wird dann in Z mit programmierter Zustellung verfahren. 3. Danach werden die einzelnen Elemente in einer Mittelpunktsbahn gefräst. 4. Anschließend wird das Werkzeug zum Startpunkt zurück geführt.

# String197
source: Starting point in X direction: The starting point of the first hole from the zero point is specified here.
de: Startpunkt in X-Richtung: Hier wird der Startpunkt der ersten Bohrung vom Nullpunkt aus angeben.

# String198
source: Starting point in Y direction: The starting point of the first hole from the zero point is specified here.
de: Startpunkt in Y-Richtung: Hier wird der Startpunkt der ersten Bohrung vom Nullpunkt aus angeben.

# String199
source: Distance in X direction: The distance between the holes in the X direction is specified here.
de: Abstand in X-Richtung: Hier wird der Abstand der Bohrungen in X-Richtung angeben.

# String2
source: Settings
de: Einstellungen

# String20
source: Circle pocket
de: Kreistasche

# String200
source: Distance in Y direction: The distance between the holes in the Y direction is specified here.
de: Abstand in Y-Richtung: Hier wird der Abstand der Bohrungen in Y-Richtung angeben.

# String201
source: Number of columns: The number of columns is specified here.
de: Anzahl der Spalten: Hier wird die Anzahl der Spalten angeben.

# String202
source: Number of lines: The number of lines is specified here.
de: Anzahl der Zeilen: Hier wird die Anzahl der Zeilen angeben.

# String203
source: Twist angle: This allows the hole pattern to be rotated in position at a specific angle. The rotation is based on the coordinates of the starting hole. Positive values rotate counterclockwise, negative values rotate clockwise.
de: Verdrehwinkel: Damit kann das Bohrbild mit einem bestimmten Winkel in seiner Lage verdreht werden. Gedreht wird um die Koordinate der Startbohrung. Positive Werte drehen gegen Uhrzeigersinn, negative Werte im Uhrzeigersinn.

# String204
source: Groove width in mm
de: Nutbreite in mm

# String205
source: Final depth: The depth to which the ring groove is to be milled.
de: Finale Tiefe: Die Tiefe auf die die Ringnut gefräst werden soll.

# String206
source: Outer diameter: Specify the external diameter of the ring groove here!
de: Außendurchmesser: Hier den Außendruchmesser der Ringnut angeben!

# String207
source: Inner diameter: Specify the inner diameter of the ring groove here!
de: Innendurchmesser: Hier den Innendurchmesser der Ringnut angeben!

# String208
source: Middle in X: The distance of the groove in the X direction from the touch point. If you enter 0.0, the center is in the center of the partial circle!
de: Mitte in X: Der Abstand der Nut in X-Richtung vom Antastpunkt. Bei Eingabe von 0.0 liegt die Mitte im Zentrum des Teilkreises!

# String209
source: Middle in Y: The distance of the groove in the Y direction from the touch point. If you enter 0.0, the center is in the center of the partial circle!
de: Mitte in Y: Der Abstand der Nut in Y-Richtung vom Antastpunkt. Bei Eingabe von 0.0 liegt die Mitte im Zentrum des Teilkreises!

# String21
source: Rectangular tenon
de: Rechteckzapfen

# String210
source: Pitch circle diameter: The radius that passes through the center of the groove.
de: Teilkreisdurchmesser: Der Radius, der durch die Mitte der Nut verläuft.

# String211
source: Side length (groove width): The width of the groove is entered here.
de: Seitenlänge (Nutbreite): Hier wird die Breite der Nut eingegeben.

# String212
source: Start angle: The starting angle from the center of the radius to the right end of the groove is specified here. The calculation is counterclockwise.
de: Startwinkel: Hier wird der Startwinkel, vom Radiusmittelpunkt zum rechten Ende der Nut angegeben. Dabei wird gegen den Uhrzeigersinn gerechnet.

# String213
source: Opening angle: The opening angle from the right end of the groove to the left end of the groove is specified here. The calculation is counterclockwise.
de: Öffnungswinkel: Hier wird der Öffnungswinkel, vom rechten Ende der Nut zum linken Ende der Nut angegeben. Dabei wird gegen den Uhrzeigersinn gerechnet.

# String214
source: Final depth: The depth to which the seal groove should be milled.
de: Finale Tiefe: Die Tiefe auf die die Dichtungsnut gefräst werden soll.

# String215
source: Dimensions outside in the X direction: The dimension of the sealing groove outside, in the X direction.
de: Abmessung aussen in X-Richtung: Die Abmessung der Dichtungsnut aussen, in X-Richtung.

# String216
source: Dimensions outside in the Y direction: The dimension of the sealing groove outside, in the Y direction.
de: Abmessung aussen in Y-Richtung: Die Abmessung der Dichtungsnut aussen, in Y-Richtung.

# String217
source: Groove width: Enter the groove width here.
de: Nutbreite: Hier die Nutbreite eingeben.

# String218
source: Hole circle diameter: Specifies the diameter of the bolt circle. The diameter runs through the center of each hole.
de: Lochkreis Durchmesser: Gibt den Durchmesser des Lochkreis an. Der Durchmesser verläuft durch das Zentrum jeder Bohrung.

# String219
source: Number of holes: The number of holes that are distributed over 360° on the bolt circle is specified here. Note: A maximum of 12 holes can be used!
de: Anzahl der Bohrungen: Hier wird die Anzahl der Bohrungen angegeben, die auf dem Lochkreis auf 360° verteilt werden. Hinweis: Es können maximal 12 Bohrungen verwendet werden!

# String22
source: Circular tenon
de: Kreiszapfen

# String220
source: Start angle: Starting angle of the first hole starting from the right middle of the bolt circle. The holes are then distributed counterclockwise.
de: Startwinkel: Startwinkel der ersten Bohrung ausgehend von rechts Mitte des Lochkreis. Die Bohrungen werden dann gegen den Uhrzeigersinn verteilt.

# String221
source: Cutter diameter: A center line is milled in the middle of each letter. A small milling cutter, a Gavier milling cutter or a ball milling cutter is recommended.
de: Fräserdurchmesser: Gefräst wird jeweils eine Mittelpunkbahn in der Mitte des Buchstaben. Empfohlen wird ein kleiner Fräser, ein Gavierfräser oder ein Kugelfräser.

# String222
source: Spindle speed: Due to the small cutter diameter, a high speed should be selected.
de: Spindeldrehzahl: Es sollte hier auf Grund des kleinen Fräserdurchmessers, eine hohe Drehzahl gewählt werden.

# String223
source: Final depth: The depth to which the font should be milled.
de: Finale Tiefe: Die Tiefe, auf die die Schrift gefräst werden soll.

# String224
source: Delivery in Z: Dimension by which the tool is advanced in one pass in order to reach the final depth.
de: Zustellung in Z: Maß, um welches das Werkzeug jeweils maximal bei einem Durchgang zugestellt wird, um die finale Tiefe zu erreichen.

# String225
source: Letter or text: Here you can enter either a letter, numbers, special characters or a short text. Allowed special characters are: . & ' @ \\\\ } ) ] ; , $ \\ = ! / > # < - { ( [ | % + ? ^ ; *
de: Buchstabe oder Text: Hier kann wahlweise ein Buchstabe, Ziffern, Sonderzeichen oder ein kurzer Text eingegeben werden. Erlaubte Sonderzeichen sind: . & ' @ \\\\ } ) ] ; , $ \\ = ! / > # < - { ( [ | % + ? ^ ; *

# String226
source: Font height: The font height is entered here in mm!
de: Schrifthöhe: Hier wird die Schrifthöhe in mm eingegeben!

# String227
source: Font: The font can be selected here!
de: Schriftart: Hier die Schriftart ausgewählt werden!

# String228
source: Cutter diameter: A center line is milled in the middle of each line. A small milling cutter, a Gavier milling cutter or a ball milling cutter is recommended.
de: Fräserdurchmesser: Gefräst wird jeweils eine Mittelpunkbahn in der Mitte der Linien. Empfohlen wird ein kleiner Fräser, ein Gavierfräser oder ein Kugelfräser.

# String229
source: Final depth: The depth to which the lines should be milled.
de: Finale Tiefe: Die Tiefe, auf die die Linien gefräst werden sollen.

# String23
source: Groove
de: Nut

# String230
source: Milling method
de: Fräsmethode

# String231
source: Code generation has stopped! There is an input error! Check all parameters for correct entry! Only numbers and the ',' may be used!
de: Die Code Generierung wurde gestoppt! Es liegt ein Eingabefehler vor! Alle Parameter auf korrekte Eingabe kontrollieren! Es dürfen nur Zahlen und das ',' verwendet werden!

# String232
source: Warning message
de: Warnmeldung

# String233
source: Code generation has stopped! No file was selected!
de: Die Code Generierung wurde gestoppt! Es wurde keine Datei ausgewählt!

# String234
source: Code generation has stopped! The imported DXF file contains values in Z, which are smaller or larger. Not a pure 2D drawing!"
de: Die Code Generierung wurde gestoppt! Die eingelesene DXF-Datei enthält Werte in Z, die kleiner oder größer sind. Keine reine 2D-Zeichnung !"

# String235
source: ( NC data created with NC tool )
de: ( NC-Daten erstellt mit NC-Tool )

# String236
source: ( Programm: Plane milling in X and Y directions )
de: ( Programm: Planfraesen in X und Y-Richtung )

# String237
source: ( Tool diameter
de: ( Werkzeugdurchmesser

# String238
source: G-code generation was aborted! The cutter diameter must be greater than 0 and less than or equal to 16 mm!
de: Die G-Code Generierung wurde abgebrochen! Der Fräserdurchmesser muss größer als 0 und kleiner oder gleich 16 mm sein!

# String239
source: Input error
de: Eingabefehler

# String24
source: Ring Groove
de: Ringnut

# String240
source: G-code generation was aborted! The spindle speed must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Die Spindeldrehzahl muss größer als 0 sein!

# String241
source: G-code generation was aborted! Check spindle speed (input value is greater than 25000)!
de: Die G-Code Generierung wurde abgebrochen! Spindeldrehzahl kontrollieren (Eingabewert ist größer als 25000)!

# String242
source: G-code generation was aborted! The safety distance between the tool and the workpiece surface should be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Der Sicherheitsabstand zwischen Werkzeug und Werkstückoberfläche sollte größer als 0 sein!

# String243
source: G-code generation was aborted! The safety distance between the tool and the workpiece surface must be within the working area of the machine!
de: Die G-Code Generierung wurde abgebrochen! Der Sicherheitsabstand zwischen Werkzeug und Werkstückoberfläche muss sich im Arbeitsbereich der Maschine befinden!

# String244
source: G-code generation was aborted! The milling depth must be less than 0!
de: Die G-Code Generierung wurde abgebrochen! Die Frästiefe muss kleiner als 0 sein !

# String245
source: G-code generation was aborted! The milling depth must be within the working area of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Frästiefe muss sich im Arbeitsbereich der Maschine befinden!

# String246
source: G-code generation was aborted! The delivery in Z for one round must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Die Zustellung in Z für einen Umlauf muss größer als 0 sein!

# String247
source: G-code generation was aborted! The feed in Z must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Der Vorschub in Z muss größer als 0 sein!

# String248
source: G-code generation was aborted! The feed in Z is greater than the maximum feed of the machine!
de: Die G-Code Generierung wurde abgebrochen! Der Vorschub in Z ist größer als der maximale Vorschub der Maschine!

# String249
source: G-code generation was aborted! The work feedrate in X/Y must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Der Arbeitsvorschub in X/Y muss größer als 0 sein!

# String25
source: Sealing Groove
de: Dichtungsnut

# String250
source: G-code generation was aborted! The work feed in X/Y is too large!
de: Die G-Code Generierung wurde abgebrochen! Der Arbeitsvorschub in X/Y ist zu groß!

# String251
source: G-code generation was aborted! The dimensions for the raw material in X must be greater than 0 and less than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Maßangaben für das Rohmaterial in X müssen größer als 0 und kleiner als der maximale Fahrweg der Maschine sein!

# String252
source: G-code generation was aborted! The dimensions for the raw material in Y must be greater than 0 and less than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Maßangaben für das Rohmaterial in Y müssen größer als 0 und kleiner als der maximale Fahrweg der Maschine sein!

# String253
source: ( Passage
de: ( Durchgang

# String254
source: ( end of program )
de: ( Programmende )

# String255
source: Delivery Z=
de: Zustellung Z=

# String256
source: G-code generation was aborted! The pocket widths must be larger than the tool diameter!
de: Die G-Code Generierung wurde abgebrochen! Die Taschenbreiten müssen größer als der Werkzeugdurchmesser sein!

# String257
source: G-code generation was aborted! The corner radius was chosen too small for this tool!
de: Die G-Code Generierung wurde abgebrochen! Der Eckenradius wurde für dieses Werkzeug zu klein gewählt!

# String258
source: G-code generation was aborted! The corner radius must not be larger than half the pocket width!
de: Die G-Code Generierung wurde abgebrochen! Der Eckenradius darf nicht größer sein, als die halbe Taschenbreite!

# String259
source: G-code generation was aborted! There is no finishing allowance specified for finishing, the value must be greater than or equal to 0!
de: Die G-Code Generierung wurde abgebrochen! Es ist kein Schlichtaufmaß zum schlichten angegeben, der Wert muss größer oder gleich 0 sein!

# String26
source: Round Groove
de: Runde Nut

# String260
source: Division by zero not possible!
de: Diffision durch Null nicht möglich!

# String261
source: ( Program: roughing rectangular pocket )
de: ( Programm: Rechtecktasche schruppen )

# String262
source: ( Program: Finish rectangle bag )
de: ( Programm: Rechtecktasche schlichten )

# String263
source: (Program: milling rectangular tenons)
de: ( Programm: Rechteckzapfen fräsen )

# String264
source: G-code generation was aborted! The milling depth must be less than 0 (enter negative values) and it must be within the machine's working area!
de: Die G-Code Generierung wurde abgebrochen! Die Frästiefe muss kleiner als 0 sein (negative Werte einegeben) und sie muss sich im Arbeitsbereich der Maschine befinden!

# String265
source: G-code generation was aborted! The dimension for the tenon in X must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Die Abmessung für den Zapfen in X müssen größer als 0 sein!

# String266
source: G-code generation was aborted! The dimensions for the pin in X must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Abmessung für den Zapfen in X müssen kleiner als der maximale Fahrweg der Maschine sein!

# String267
source: G-code generation was aborted! The dimension for the tenon in Y must be greater than 0!
de: Die G-Code Generierung wurde abgebrochen! Die Abmessung für den Zapfen in Y müssen größer als 0 sein!

# String268
source: G-code generation was aborted! The dimensions for the pin in Y must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Abmessung für den Zapfen in Y müssen kleiner als der maximale Fahrweg der Maschine sein!

# String269
source: G-code generation was aborted! The dimensions for the raw material in X must be greater than or equal to 0!
de: Die G-Code Generierung wurde abgebrochen! Die Maßangaben für das Rohmaterial in X müssen größer oder gleich 0 sein!

# String27
source: Drilling table
de: Bohrtabelle

# String270
source: G-code generation was aborted! The dimensions for the raw material in X must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Maßangaben für das Rohmaterial in X müssen kleiner als der maximale Fahrweg der Maschine sein!

# String271
source: G-code generation was aborted! The dimensions for the raw material in Y must be greater than or equal to 0!
de: Die G-Code Generierung wurde abgebrochen! Die Maßangaben für das Rohmaterial in Y müssen größer oder gleich 0 sein!

# String272
source: G-code generation was aborted! The dimensions for the raw material in Y must be smaller than the maximum travel distance of the machine!
de: Die G-Code Generierung wurde abgebrochen! Die Maßangaben für das Rohmaterial in Y müssen kleiner als der maximale Fahrweg der Maschine sein!

# String273
source: G-code generation was aborted! The diameter of the raw part must be smaller than the diameter of the finished part!
de: Die G-Code Generierung wurde abgebrochen! Der Durchmesser des Rohteil muss kleiner als der Durchmesser des Fertigteil sein!
